Revit 2024 API
IFCFile.Read Method (IFCFileReadOptions)
 Reads content from a file of IFC format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void Read(
	IFCFileReadOptions readOptions
)
Visual Basic
Public Sub Read ( _
	readOptions As IFCFileReadOptions _
)
Visual C++
public:
void Read(
	IFCFileReadOptions^ readOptions
)
Parameters
readOptions
Type: Autodesk.Revit.DB.IFC.IFCFileReadOptions
 The IFC file read options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Error reading opening model for unzipping. Error reading IFC file.
See Also
IFCFile Class
Read Overload
Autodesk.Revit.DB.IFC Namespace